---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.GetKeys
source: html/9dae03bf-c7d8-a10b-329d-f6fb01c23d30.htm
---
# Autodesk.Revit.DB.ExportFontTable.GetKeys Method

Returns a collection of the keys stored in this table.

## Syntax (C#)
```csharp
public IList<ExportFontKey> GetKeys()
```

## Returns
The collection of keys.